{
  "id": "-wRYm-iCZg",
  "publishDate": "2024-03-25T10:46:06",
  "eventDate": "2024-05-03T10:46:06.000-07:00",
  "format": "Live",
  "title": "Bijou",
  "eventLocation": "San Francisco, CA",
  "venue": "Pure",
  "ticketLink": "https://forms.gle/bgkZVQLJSEdheQUk6",
  "linkText": "FREE GUESTLIST",
  "photoUrl": "/media/bijou-pure-fri.png",
  "isPromoCodeEnabled": false,
  "mobileTicketLink": "https://my.community.com/dirtynotsorry?t=BIJOU",
  "description": "▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄\n\nHeadliner:\n\n**► Bijou**\n\n\n[Linktr.ee/djbijou](https://www.linktr.ee/djbijou)\n\n\nBIJOU, or as his friends know him, Ben Dorman, is a modern-day icon redefining the house music scene. Carving a niche in the ever-evolving music landscape, this trailblazer has emerged as a powerful force, seamlessly navigating the industry's challenges with unparalleled grace.\n\nFrom the breakout banger “Hello” with Dr. Fresch in 2016, BIJOU's sonic journey has been nothing short of phenomenal. The past several years have seen him drop fire singles like \"I KNOW\" with Marten Horger, “The Players Anthem” featuring Benny The Butcher and “Gang Gang”. Add to that, chart-topping EPs like 'Gangsta Party' and 'Street Knowledge', and it’s clear why he's a force to be reckoned with. Not stopping at just producing, he’s embarked on multiple sold out tours and even pioneered his own record label, Do Not Duplicate Recordings (DND RECS).\n\nPeek behind BIJOU's meteoric rise, and you'll find relentless dedication and many studio-lit nights. Melding ageless hip-hop vibes with classic house undertones, he masterfully caters to today's house aficionados, producing tracks that are underground at heart but absolutely main-stage ready. So here’s to BIJOU: the future of G-house, today.\n\n\n\n\n\nSupport:\n\n**► Jay Bird**\n\n\n[Linktr.ee/jayb1rdmusic](https://www.linktr.ee/jayb1rdmusic)\n\n\n\n\n\n\n**► Luco**\n\n\n[Linktr.ee/itslucomusic](https://www.linktr.ee/itslucomusic)\n\n\n\n\n\n\n**► Chris Carey**\n\n\n[Instagram.com/ccarey294](https://www.instagram.com/ccarey294)\n\n\n\n[Twitch.tv/studio6SJ](https://www.twitch.tv/studio6SJ)\n\n"
}