{
  "isPromoCodeEnabled": false,
  "id": "iA5H-Y4LDt",
  "publishDate": "2024-07-22T23:53:08-07:00",
  "eventDate": "2024-08-23T23:52:47.000-07:00",
  "format": "Live",
  "title": "Borgeous",
  "eventLocation": "San Francisco, CA",
  "venue": "YOLO Nightclub",
  "ticketLink": "https://tixr.com/pr/DNS/110258 ",
  "linkText": "FREE GUESTLIST",
  "photoUrl": "/media/fwdyoloborgeousrevised.png",
  "description": "The LA-based Platinum recording artist and DJ/producer is quickly making waves in the scene and has already accomplished three Billboard Dance Radio Top 10’s, three Beatport #1’s and a #1 on the iTunes Dancechart in 15 different countries. His keen ear and innate talent to produce a provocative, textured sound have made people take notice.\n\nHis biggest hit to-date “Tsunami” is exactly as its title suggests as the hit single wrecked bars, clubs, festival stages and radio stations around the world, gaining BORGEOUS international acclaim. It reached #1 on iTunes in 15 different countries, #1 on Beatport, received an EMPO Award for ‘Track of the Year’ and was nominated for the Juno Award ‘Best Dance Recording of the Year’. In 2014, he reached the top 10 on Billboard’s Dance Radio chart not just once, but twice with “Invincible” and “Wildfire”. “Invincible” also became the #2 Song of 2014 on SiriusXM’s BPM Radio and Wildfire was #14. BORGEOUS’ remix work is no less impressive. He was recruited to remake Afrojack’s lead single featuring Wrabel, “Ten Feet Tall” for Universal Music as well as Ariana Grande’s “One Last Time”. It was in this year that SiriusXM gave him a residency and picked up his extremely successful weekly podcast “House of Borgeous”. He was also ranked in DJ Mag’s Top 100 DJs at #87. His production prowess combined with a wicked DJ aptitude makes for an unparalleled performance.\n\n2015 Anthem, his ever-so-beautiful original “Zero Gravity” featuring electro pop sensation LIGHTS that went #5 on iTunes Dance Charts in Canada, his collab with Wiz Khalifa, Waka Flocka & DJ Whoo Kid “Toast” and many more. In the midst of a jam-packed release schedule, he is also touring the globe with shows all over the world.\n\n21+\n\nVIP Bottle Service call 415.757.0703 | Text 408.658.8807\n"
}