{
  "isPromoCodeEnabled": false,
  "id": "2WexSwIpJ4",
  "publishDate": "2025-06-13T16:01:23-07:00",
  "eventDate": "2025-07-05T16:01:11.000-07:00",
  "format": "Live",
  "title": "Kaysin",
  "eventLocation": "San Francisco, CA",
  "venue": "Madarae",
  "ticketLink": "https://www.eventbrite.com/e/1411566295789",
  "photoUrl": "/media/kaysin-flyer-draft-1080-x-1080-px-.png",
  "linkText": "FREE GUESTLIST",
  "description": "Dirty Not Sorry & Housology Present the San Francisco Debut of Kaysin at Madarae!\n\n### Headliner:\n\n**► Kaysin**\n\n[Kaysin.com](https://www.kaysin.com)\n\nKaysin [Repopulate Mars, South of Saturn] is a rising house music technician in the US dance scene. Hailing from LA, he has found his home on Lee Foss’ labels, where he frequently releases and likewise serves as Head of A&R. Kaysin’s music can also be found on tastemaker artist run labels such as Matroda’s Terminal Underground and Noizu’s Teche, as well as global imprints such as Thrive and Myth of Nyx. Over the past few years, his releases have charted in the Top 10 on Beatport, and been supported by influential names across the genre - from Fisher to Vintage Culture to Tiesto. He’s likewise been tapped for remix duty for John Summit, Mindchatter, and Weznday among others. Kaysin’s live shows feature a mix of his original records + the hottest ID’s from the biggest names in house music - which he often receives first through his A&R role. His shows also include his hosted Kaysin & Friends curations and South of Saturn events, featuring stacked lineups with artists like Wuki, Gudfella, and Sam Blacky. His tour schedule has seen him play top venues in his home market in LA (Academy, Sound, and Exchange) and hotspots from NYC (Superior Ingredients) to Miami (Factory Town) to Austin (Concourse Project). Summer festival stops regularly include the likes of EDC, MMW, and Day Trip Festival, and overseas tours have hit markets in Canada, Mexico, and Spain.\n\n### Support:\n\n**► Knives B2B Sato**\n\n[Dirtynotsorry.com/artists/knives](https://dirtynotsorry.com/artists/knives)\n\n[Linktr.ee/djsato](https://linktr.ee/djsato)\n\n**► Dollarhide B2B Spracto**\n\n[Dirtynotsorry.com/artists/spracto](https://dirtynotsorry.com/artists/spracto)\n\n[Linktr.ee/dollarhide22](https://linktr.ee/dollarhide22)\n\n► **Dymonds B2B HK**\n\n[Dirtynotsorry.com/artists/hk](https://dirtynotsorry.com/artists/hk)\n\n[Instagram.com/dymonds_unofficial](https://www.instagram.com/dymonds_unofficial/)\n\n► **Freeus B2B Wraith**\n\n[Linktr.ee/freeusofficial](https://linktr.ee/freeusofficial)\n\n[Dirtynotsorry.com/artists/wraith](https://dirtynotsorry.com/artists/wraith)\n",
  "mobileTicketLink": ""
}