{
  "id": "dzotoKzf_E",
  "publishDate": "2024-03-31T22:00:39-07:00",
  "eventDate": "2024-05-10T10:47:39.000-07:00",
  "format": "Live",
  "title": "Nostalgix",
  "eventLocation": "San Francisco, CA",
  "venue": "Pure",
  "ticketLink": "https://www.purenightclub408.com/event/nostalgix-05-10-24/?rn=dns",
  "photoUrl": "/media/nostalgix-pure-square-edit.png",
  "linkText": "TICKETS",
  "isPromoCodeEnabled": false,
  "description": "**Headliner:**\n\n\n\n\n\n**► Nostalgix**\n\n\n[Nostalgix.komi.io](https://www.Nostalgix.komi.io)\n\n\n\n\n\n\nBorn in Iran with roots in the Canadian dance music scene, Nostalgix is the epitome of a triple-threat in the industry. As a producer, writer, and rapper, Nostalgix incorporates spunky charm and a ’90s edge into her signature sound through thunderous basslines and electrifying beats. Nostalgix and her unmistakable style appear on leading dance music labels, including Night Bass, Confession, Thrive Music, Insomniac Records, UKF, and many more.\n\nStepping onto the scene as a modern-day iteration of the ‘90s ‘It Girl,’ Nostalgix is committed to building a positive, loving environment in dance music. With a sound that continues to travel far and wide, Nostalgix has performed on the world’s most coveted stages in dance music, including EDC Las Vegas, HARD Summer, Beyond Wonderland, Spring Awakening, and more.\n\nThough she has demonstrated a steady rise since her debut, 2022 was a pivotal year for Nostalgix: hit singles such as “My Type” on Night Bass and “Badman” on Thrive Music kicked off the year while she embarked on a handful of North American tours alongside dance music leaders Tchami, AC Slater, Malaa, and more. That same year, Nostalgix made history as one of the few female acts to perform the mainstage at EDC Las Vegas. Shattering glass ceilings and speakers all around, Nostalgix is an unstoppable force in the modern dance scene.\n\n\n\n\n\n**Support:**\n\n\n\n\n\n**► Knives**\n\n\n[Linktr.ee/djknives](https://www.linktr.ee/djknives)\n\n\n\n\n\n\n**► RAWB**\n\n\n[Linktr.ee/rawbsound](https://www.linktr.ee/rawbsound)\n\n\n\n\n\n\n**► DJ HK**\n\n\n[Flowcode.com/page/djhk](https://www.flowcode.com/page/djhk)\n\n\n\n\n\n\nVIP Bottle Service call 408.732.2121 | Text 408.430.7756\n\n21+ Only See less\n"
}