{
  "isPromoCodeEnabled": false,
  "id": "fO_0LhjuQk",
  "publishDate": "2024-05-13T10:31:16",
  "eventDate": "2024-08-31T10:31:16.000-07:00",
  "format": "Live",
  "title": "Pool Party: Sigala",
  "eventLocation": "San Francisco, CA",
  "venue": "Phoenix Hotel",
  "ticketLink": "https://sigalasf.eventbrite.com",
  "linkText": "TICKETS",
  "photoUrl": "/media/dj-dials-15utah-summertime-radness-phoenix-hotel-2024-sigala.jpg",
  "description": "Sigala is the musical name of Bruce Fielder, a London-based DJ and producer. Born and raised in Norfolk, England, Sigala began piano as a child, and played in various bands after graduating university. He found work as a producer, and co-wrote Ella Eyre and Sigma‘s 2015 U.K. hit single “Good Times” before focusing on his own solo project.\n\nHis first solo single “Easy Love,” an energetic house tune built around a sample of the Jackson 5‘s iconic hit “ABC” released by Ministry of Sound in 2015 entered the U.K. singles chart at the coveted number one spot! His second single, “Sweet Lovin’” featuring singer/songwriter Bryn Christopher, hit number three and was certified gold and platinum in several countries around the world. Several more hits followed in 2016, including “Say You Do” featuring Imani and DJ Fresh, “Give Me Your Love”, with John Newman and the legendary Nile Rodgers, and “Ain’t Giving Up,” a collaboration with Craig David that appeared on his sixth album.\n\nIn 2017, Sigala co-produced the single “Show You Love” with Danish DJ Kato, sung by Hailee Steinfeld. He then paired with singer Paloma Faith for the 2018 single “Lullaby” which went on to receive a BRIT Awards nomination for ‘Best British Single’. Also in 2018, Sigala released his debut studio album, Brighter Days which featured a mammoth 24 featured artists including Meghan Trainor, French Montana, Sean Paul, The Vamps, Kylie Minogue and Kodaline to name a few. The album was the highest charting debut dance album of 2018 and received a BRIT certified Silver certification.\n"
}