{
  "isPromoCodeEnabled": true,
  "id": "z1jyjz7bP5",
  "publishDate": "2024-10-21T23:35:37",
  "eventDate": "2024-10-26T23:35:37.000-07:00",
  "format": "Live",
  "eventLocation": "San Francisco, CA",
  "venue": "Pier 70",
  "ticketLink": "https://www.inmotionmovement.com/event-details/spooky-halloween-5k-social",
  "promoCode": "BARCDJ",
  "promoLabel": "40% Off",
  "photoUrl": "/media/barcdj.png",
  "description": "Where: Pier 70, San Francisco, CA 94107\n\nWhen: Saturday, October 26th - 11AM to 6PM\n\nLimited parking in lot available nearby!\n\n\n\n\n\nQUICK RECAP below:\n\n11AM Bib pick-up and check-ins begin. (please come on time)\n\n12PM Race lineup and course review. (you will not be permitted to run without a bib)\n\n12:15PM Race starts! Will have prizes for the top 3 of the mens and womens division. Will also have prizes for the top 3 costumes. \n\n1PM Festivities BEGIN! As you cross the finishline, you will be walking into the amazing smells of food and the vibrant energery from our special community. \n\n\n\n\n\nFAQs\n\nThere will be a bag check area. Your bag will be permitted to search if you choose to carry a bag into the venue. There is no outside food or alchohol permitted. It will be confiscated and disposed of. There will be limited re-entry for the event. You will be allowed one re-entry after exiting the venue. There will be bathrooms at the venue. If you are innapropriate or potentially putting others in danger, you will be removed by security. \n\n\n\n\n\nBreakdown at Event\n\n- 10:15 AM - Volunteer crew arrives to set up check-in stations and prepare the course\n- 11:00 AM - Registration and check-in opens for participants\n- 12:00 PM - Pre-race announcements and costume contest judging begins\n- 12:15 PM - 5K race starts with a spooky Halloween-themed horn\n- 1:00 PM - Anticipated finish time for most runners\n- 1:00 PM - Food trucks and alcohol vendors open for business\n- 1:15 PM - Awards ceremony for top finishers and best costumes\n- 2:00 PM - Live music and entertainment begins on the main stage\n- 3:30 PM - Raffle drawing for major prizes\n- 5:00 PM - Event concludes with a final thank you to sponsors and participants\n- 6:00 PM - End of Event\n\n DJ Lineup: \n\n• 11:30 AM - 12:30 PM | Will Casella\n\n• 12:30 PM - 1:30 PM | BURSU\n\n• 1:30 PM - 2:30 PM | Avi and Shlok\n\n• 2:30 PM - 3:30 PM | Josh Tak\n\n• 3:30 PM - 4:40 PM | Kevin Label\n\n• 4:45 PM - 6:00 PM | DjKnives\n\n\n\n\n",
  "title": "Spooky Halloween 5K & Social",
  "linkText": "TICKETS"
}